sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/rtc.h
/**
 * \file
 *
 * \brief Component description for RTC
 *
 * Copyright (c) 2018 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-01-08T14:00:00Z */
#ifndef _SAMS70_RTC_COMPONENT_H_
#define _SAMS70_RTC_COMPONENT_H_
#define _SAMS70_RTC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMS_SAMS70 Real-time Clock
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR RTC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define RTC_6056                       /**< (RTC) Module ID */
#define REV_RTC W                      /**< (RTC) Module revision */

/* -------- RTC_CR : (RTC Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPDTIM:1;                  /**< bit:      0  Update Request Time Register             */
    uint32_t UPDCAL:1;                  /**< bit:      1  Update Request Calendar Register         */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TIMEVSEL:2;                /**< bit:   8..9  Time Event Selection                     */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t CALEVSEL:2;                /**< bit: 16..17  Calendar Event Selection                 */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_CR_OFFSET                       (0x00)                                        /**<  (RTC_CR) Control Register  Offset */

#define RTC_CR_UPDTIM_Pos                   0                                              /**< (RTC_CR) Update Request Time Register Position */
#define RTC_CR_UPDTIM_Msk                   (_U_(0x1) << RTC_CR_UPDTIM_Pos)                /**< (RTC_CR) Update Request Time Register Mask */
#define RTC_CR_UPDTIM                       RTC_CR_UPDTIM_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_CR_UPDTIM_Msk instead */
#define RTC_CR_UPDCAL_Pos                   1                                              /**< (RTC_CR) Update Request Calendar Register Position */
#define RTC_CR_UPDCAL_Msk                   (_U_(0x1) << RTC_CR_UPDCAL_Pos)                /**< (RTC_CR) Update Request Calendar Register Mask */
#define RTC_CR_UPDCAL                       RTC_CR_UPDCAL_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_CR_UPDCAL_Msk instead */
#define RTC_CR_TIMEVSEL_Pos                 8                                              /**< (RTC_CR) Time Event Selection Position */
#define RTC_CR_TIMEVSEL_Msk                 (_U_(0x3) << RTC_CR_TIMEVSEL_Pos)              /**< (RTC_CR) Time Event Selection Mask */
#define RTC_CR_TIMEVSEL(value)              (RTC_CR_TIMEVSEL_Msk & ((value) << RTC_CR_TIMEVSEL_Pos))
#define   RTC_CR_TIMEVSEL_MINUTE_Val        _U_(0x0)                                       /**< (RTC_CR) Minute change  */
#define   RTC_CR_TIMEVSEL_HOUR_Val          _U_(0x1)                                       /**< (RTC_CR) Hour change  */
#define   RTC_CR_TIMEVSEL_MIDNIGHT_Val      _U_(0x2)                                       /**< (RTC_CR) Every day at midnight  */
#define   RTC_CR_TIMEVSEL_NOON_Val          _U_(0x3)                                       /**< (RTC_CR) Every day at noon  */
#define RTC_CR_TIMEVSEL_MINUTE              (RTC_CR_TIMEVSEL_MINUTE_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Minute change Position  */
#define RTC_CR_TIMEVSEL_HOUR                (RTC_CR_TIMEVSEL_HOUR_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Hour change Position  */
#define RTC_CR_TIMEVSEL_MIDNIGHT            (RTC_CR_TIMEVSEL_MIDNIGHT_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Every day at midnight Position  */
#define RTC_CR_TIMEVSEL_NOON                (RTC_CR_TIMEVSEL_NOON_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Every day at noon Position  */
#define RTC_CR_CALEVSEL_Pos                 16                                             /**< (RTC_CR) Calendar Event Selection Position */
#define RTC_CR_CALEVSEL_Msk                 (_U_(0x3) << RTC_CR_CALEVSEL_Pos)              /**< (RTC_CR) Calendar Event Selection Mask */
#define RTC_CR_CALEVSEL(value)              (RTC_CR_CALEVSEL_Msk & ((value) << RTC_CR_CALEVSEL_Pos))
#define   RTC_CR_CALEVSEL_WEEK_Val          _U_(0x0)                                       /**< (RTC_CR) Week change (every Monday at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_MONTH_Val         _U_(0x1)                                       /**< (RTC_CR) Month change (every 01 of each month at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_YEAR_Val          _U_(0x2)                                       /**< (RTC_CR) Year change (every January 1 at time 00:00:00)  */
#define RTC_CR_CALEVSEL_WEEK                (RTC_CR_CALEVSEL_WEEK_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Week change (every Monday at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_MONTH               (RTC_CR_CALEVSEL_MONTH_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Month change (every 01 of each month at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_YEAR                (RTC_CR_CALEVSEL_YEAR_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Year change (every January 1 at time 00:00:00) Position  */
#define RTC_CR_MASK                         _U_(0x30303)                                   /**< \deprecated (RTC_CR) Register MASK  (Use RTC_CR_Msk instead)  */
#define RTC_CR_Msk                          _U_(0x30303)                                   /**< (RTC_CR) Register Mask  */


/* -------- RTC_MR : (RTC Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t HRMOD:1;                   /**< bit:      0  12-/24-hour Mode                         */
    uint32_t PERSIAN:1;                 /**< bit:      1  PERSIAN Calendar                         */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t NEGPPM:1;                  /**< bit:      4  NEGative PPM Correction                  */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t CORRECTION:7;              /**< bit:  8..14  Slow Clock Correction                    */
    uint32_t HIGHPPM:1;                 /**< bit:     15  HIGH PPM Correction                      */
    uint32_t OUT0:3;                    /**< bit: 16..18  RTCOUT0 OutputSource Selection           */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t OUT1:3;                    /**< bit: 20..22  RTCOUT1 Output Source Selection          */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t THIGH:3;                   /**< bit: 24..26  High Duration of the Output Pulse        */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t TPERIOD:2;                 /**< bit: 28..29  Period of the Output Pulse               */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_MR_Type;
