sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/rtc.h
/* -------- RTC_SR : (RTC Offset: 0x18) (R/ 32) Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ACKUPD:1;                  /**< bit:      0  Acknowledge for Update                   */
    uint32_t ALARM:1;                   /**< bit:      1  Alarm Flag                               */
    uint32_t SEC:1;                     /**< bit:      2  Second Event                             */
    uint32_t TIMEV:1;                   /**< bit:      3  Time Event                               */
    uint32_t CALEV:1;                   /**< bit:      4  Calendar Event                           */
    uint32_t TDERR:1;                   /**< bit:      5  Time and/or Date Free Running Error      */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_SR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_SR_OFFSET                       (0x18)                                        /**<  (RTC_SR) Status Register  Offset */

#define RTC_SR_ACKUPD_Pos                   0                                              /**< (RTC_SR) Acknowledge for Update Position */
#define RTC_SR_ACKUPD_Msk                   (_U_(0x1) << RTC_SR_ACKUPD_Pos)                /**< (RTC_SR) Acknowledge for Update Mask */
#define RTC_SR_ACKUPD                       RTC_SR_ACKUPD_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_ACKUPD_Msk instead */
#define   RTC_SR_ACKUPD_FREERUN_Val         _U_(0x0)                                       /**< (RTC_SR) Time and calendar registers cannot be updated.  */
#define   RTC_SR_ACKUPD_UPDATE_Val          _U_(0x1)                                       /**< (RTC_SR) Time and calendar registers can be updated.  */
#define RTC_SR_ACKUPD_FREERUN               (RTC_SR_ACKUPD_FREERUN_Val << RTC_SR_ACKUPD_Pos)  /**< (RTC_SR) Time and calendar registers cannot be updated. Position  */
#define RTC_SR_ACKUPD_UPDATE                (RTC_SR_ACKUPD_UPDATE_Val << RTC_SR_ACKUPD_Pos)  /**< (RTC_SR) Time and calendar registers can be updated. Position  */
#define RTC_SR_ALARM_Pos                    1                                              /**< (RTC_SR) Alarm Flag Position */
#define RTC_SR_ALARM_Msk                    (_U_(0x1) << RTC_SR_ALARM_Pos)                 /**< (RTC_SR) Alarm Flag Mask */
#define RTC_SR_ALARM                        RTC_SR_ALARM_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_ALARM_Msk instead */
#define   RTC_SR_ALARM_NO_ALARMEVENT_Val    _U_(0x0)                                       /**< (RTC_SR) No alarm matching condition occurred.  */
#define   RTC_SR_ALARM_ALARMEVENT_Val       _U_(0x1)                                       /**< (RTC_SR) An alarm matching condition has occurred.  */
#define RTC_SR_ALARM_NO_ALARMEVENT          (RTC_SR_ALARM_NO_ALARMEVENT_Val << RTC_SR_ALARM_Pos)  /**< (RTC_SR) No alarm matching condition occurred. Position  */
#define RTC_SR_ALARM_ALARMEVENT             (RTC_SR_ALARM_ALARMEVENT_Val << RTC_SR_ALARM_Pos)  /**< (RTC_SR) An alarm matching condition has occurred. Position  */
#define RTC_SR_SEC_Pos                      2                                              /**< (RTC_SR) Second Event Position */
#define RTC_SR_SEC_Msk                      (_U_(0x1) << RTC_SR_SEC_Pos)                   /**< (RTC_SR) Second Event Mask */
#define RTC_SR_SEC                          RTC_SR_SEC_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_SEC_Msk instead */
#define   RTC_SR_SEC_NO_SECEVENT_Val        _U_(0x0)                                       /**< (RTC_SR) No second event has occurred since the last clear.  */
#define   RTC_SR_SEC_SECEVENT_Val           _U_(0x1)                                       /**< (RTC_SR) At least one second event has occurred since the last clear.  */
#define RTC_SR_SEC_NO_SECEVENT              (RTC_SR_SEC_NO_SECEVENT_Val << RTC_SR_SEC_Pos)  /**< (RTC_SR) No second event has occurred since the last clear. Position  */
#define RTC_SR_SEC_SECEVENT                 (RTC_SR_SEC_SECEVENT_Val << RTC_SR_SEC_Pos)    /**< (RTC_SR) At least one second event has occurred since the last clear. Position  */
#define RTC_SR_TIMEV_Pos                    3                                              /**< (RTC_SR) Time Event Position */
#define RTC_SR_TIMEV_Msk                    (_U_(0x1) << RTC_SR_TIMEV_Pos)                 /**< (RTC_SR) Time Event Mask */
#define RTC_SR_TIMEV                        RTC_SR_TIMEV_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_TIMEV_Msk instead */
#define   RTC_SR_TIMEV_NO_TIMEVENT_Val      _U_(0x0)                                       /**< (RTC_SR) No time event has occurred since the last clear.  */
#define   RTC_SR_TIMEV_TIMEVENT_Val         _U_(0x1)                                       /**< (RTC_SR) At least one time event has occurred since the last clear.  */
#define RTC_SR_TIMEV_NO_TIMEVENT            (RTC_SR_TIMEV_NO_TIMEVENT_Val << RTC_SR_TIMEV_Pos)  /**< (RTC_SR) No time event has occurred since the last clear. Position  */
#define RTC_SR_TIMEV_TIMEVENT               (RTC_SR_TIMEV_TIMEVENT_Val << RTC_SR_TIMEV_Pos)  /**< (RTC_SR) At least one time event has occurred since the last clear. Position  */
#define RTC_SR_CALEV_Pos                    4                                              /**< (RTC_SR) Calendar Event Position */
#define RTC_SR_CALEV_Msk                    (_U_(0x1) << RTC_SR_CALEV_Pos)                 /**< (RTC_SR) Calendar Event Mask */
#define RTC_SR_CALEV                        RTC_SR_CALEV_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_CALEV_Msk instead */
#define   RTC_SR_CALEV_NO_CALEVENT_Val      _U_(0x0)                                       /**< (RTC_SR) No calendar event has occurred since the last clear.  */
#define   RTC_SR_CALEV_CALEVENT_Val         _U_(0x1)                                       /**< (RTC_SR) At least one calendar event has occurred since the last clear.  */
#define RTC_SR_CALEV_NO_CALEVENT            (RTC_SR_CALEV_NO_CALEVENT_Val << RTC_SR_CALEV_Pos)  /**< (RTC_SR) No calendar event has occurred since the last clear. Position  */
#define RTC_SR_CALEV_CALEVENT               (RTC_SR_CALEV_CALEVENT_Val << RTC_SR_CALEV_Pos)  /**< (RTC_SR) At least one calendar event has occurred since the last clear. Position  */
#define RTC_SR_TDERR_Pos                    5                                              /**< (RTC_SR) Time and/or Date Free Running Error Position */
#define RTC_SR_TDERR_Msk                    (_U_(0x1) << RTC_SR_TDERR_Pos)                 /**< (RTC_SR) Time and/or Date Free Running Error Mask */
#define RTC_SR_TDERR                        RTC_SR_TDERR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_SR_TDERR_Msk instead */
#define   RTC_SR_TDERR_CORRECT_Val          _U_(0x0)                                       /**< (RTC_SR) The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR).  */
#define   RTC_SR_TDERR_ERR_TIMEDATE_Val     _U_(0x1)                                       /**< (RTC_SR) The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid.  */
#define RTC_SR_TDERR_CORRECT                (RTC_SR_TDERR_CORRECT_Val << RTC_SR_TDERR_Pos)  /**< (RTC_SR) The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR). Position  */
#define RTC_SR_TDERR_ERR_TIMEDATE           (RTC_SR_TDERR_ERR_TIMEDATE_Val << RTC_SR_TDERR_Pos)  /**< (RTC_SR) The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid. Position  */
#define RTC_SR_MASK                         _U_(0x3F)                                      /**< \deprecated (RTC_SR) Register MASK  (Use RTC_SR_Msk instead)  */
#define RTC_SR_Msk                          _U_(0x3F)                                      /**< (RTC_SR) Register Mask  */


/* -------- RTC_SCCR : (RTC Offset: 0x1c) (/W 32) Status Clear Command Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ACKCLR:1;                  /**< bit:      0  Acknowledge Clear                        */
    uint32_t ALRCLR:1;                  /**< bit:      1  Alarm Clear                              */
    uint32_t SECCLR:1;                  /**< bit:      2  Second Clear                             */
    uint32_t TIMCLR:1;                  /**< bit:      3  Time Clear                               */
    uint32_t CALCLR:1;                  /**< bit:      4  Calendar Clear                           */
    uint32_t TDERRCLR:1;                /**< bit:      5  Time and/or Date Free Running Error Clear */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_SCCR_Type;
